Student: Satish Byrow

#**1. Goal**
- For this project, you have been hired to produce a MySQL database on Movies from a subset of IMDB's publicly available dataset. Ultimately, you will use this database to analyze what makes a movie successful and will provide recommendations to the stakeholder on how to make a successful movie.

##Dictionary
TBC

#**2. Import and Loading**

## Load Libraries

In [1]:
#Load Libraries
import pandas as pd
import numpy as np

## Load Data

In [2]:
## Loading data from local repository
basics_url="Data/title.basics.tsv.gz"
rating_url="Data/title.ratings.tsv.gz"
akas_url="Data/title.akas.tsv.gz"

basics = pd.read_csv(basics_url, sep='\t', low_memory=False)
ratings = pd.read_csv(rating_url, sep='\t', low_memory=False)
akas = pd.read_csv(akas_url, sep='\t', low_memory=False)

In [3]:
#Remove null values
basics.replace({'\\N':np.nan}, inplace=True)
ratings.replace({'\\N':np.nan}, inplace=True)
akas.replace({'\\N':np.nan}, inplace=True)

#**3. Explore Data Set**

In [4]:
#Check then data
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"

In [5]:
#Check then data
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10243653 entries, 0 to 10243652
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 703.4+ MB

In [6]:
#Check then data
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000003            6.5      1892
3  tt0000004            5.5       178
4  tt0000005            6.2      2678

In [7]:
#Check then data
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

In [8]:
#Check then data
akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37510211 entries, 0 to 37510210
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 2.2+ GB

#**4. Clean Data Set**

In [9]:
#Check all records with runtime minutes null
basics['runtimeMinutes'].isnull().sum()

7154281

In [10]:
#Check all records with runtime minutes null
indexNames = basics[(basics['runtimeMinutes'].isnull())].index 
# Delete these row indexes from dataFrame
basics.drop(indexNames , inplace=True)
basics['runtimeMinutes'].isnull().sum()

0

In [11]:
#Check all records with genre minutes null
basics['genres'].isnull().sum()

80733

In [12]:
#Check all records with genres null
indexNames = basics[(basics['genres'].isnull())].index 
# Delete these row indexes from dataFrame
basics.drop(indexNames , inplace=True)
basics['genres'].isnull().sum()

0

In [13]:
#Count all records before
basics[~basics['titleType'].str.contains("Movie", case=False)].count()

tconst            2525073
titleType         2525073
primaryTitle      2525072
originalTitle     2525072
isAdult           2525073
startYear         2341222
endYear             52699
runtimeMinutes    2525073
genres            2525073
dtype: int64

In [14]:
#Check all records with titletype that does not have movie
indexNames = basics[~(basics['titleType'].str.contains("Movie", case=False))].index 
# Delete these row indexes from dataFrame
basics.drop(indexNames , inplace=True)

In [15]:
#Check all records after
basics['titleType'].str.contains("Movie", case=False).count()

483566

In [16]:
basics['startYear'].count()

476578

In [17]:
#Check all records with year
basics = basics[basics['startYear'].str.contains('2000|2001|2002', na=False, regex=True, case=False)]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34800,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
93927,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama
100065,tt0102362,movie,Istota,Istota,0,2000,NaN,80,"Drama,Romance"
106700,tt0109173,movie,Auf allen Meeren,Auf allen Meeren,0,2002,NaN,95,Documentary
110353,tt0112912,movie,Dune 7,Dune 7,0,2002,NaN,97,Adventure
...,...,...,...,...,...,...,...,...,...
10214509,tt9853452,movie,Veszett idök,Veszett idök,0,2001,NaN,62,Fantasy
10215286,tt9855208,tvMovie,"San Luis Potosí, Entre el Oro y la Plata, el E...","San Luis Potosí, Entre el Oro y la Plata, el E...",0,2001,NaN,26,Documentary
10224024,tt9874290,movie,Star Trek: Incident at Beta 9,Star Trek: Incident at Beta 9,0,2002,NaN,57,Sci-Fi
10224207,tt9874664,tvMovie,Tyrnavos: I politeia tou krasiou kai tis ampelou,Tyrnavos: I politeia tou krasiou kai tis ampelou,0,2001,NaN,60,Documentary
10224466,tt9875278,movie,Dømt som far,Dømt som far,0,2001,NaN,54,Documentary

In [18]:
basics['startYear'].count()

16992

In [19]:
# Exclude movies that are included in the documentary category.
is_documentary = basics['genres'].str.contains('documentary',case=False)
basics = basics[~is_documentary]

In [20]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

In [21]:
# Filter the basics table down to only include the US by using the filter akas dataframe
is_us = (akas['region'] == 'US')
akas = akas[is_us]
keepers = (basics['tconst'].isin(akas['titleId']))
keepers

34800        True
93927        True
100065      False
110353      False
110465       True
            ...
10196897    False
10207380    False
10210601    False
10214509    False
10224024     True
Name: tconst, Length: 11387, dtype: bool

In [22]:
basics = basics[keepers]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34800,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
93927,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama
110465,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000,NaN,86,"Musical,Romance"
110528,tt0113092,movie,For the Cause,For the Cause,0,2000,NaN,100,"Action,Adventure,Drama"
111839,tt0114447,movie,The Silent Force,The Silent Force,0,2001,NaN,90,Action
...,...,...,...,...,...,...,...,...,...
10076011,tt9555974,movie,Haunted School,Gui xue xiao,0,2001,NaN,85,Horror
10086061,tt9578462,movie,Crying Sky,Ku qi de tian kong,0,2001,NaN,85,Drama
10097266,tt9602302,tvMovie,"Get in, and Go",Shang che zou ba,0,2000,NaN,113,Drama
10135306,tt9683502,movie,Bottle Blonde and Beautiful,Bottle Blonde and Beautiful,0,2002,NaN,45,Drama
10224024,tt9874290,movie,Star Trek: Incident at Beta 9,Star Trek: Incident at Beta 9,0,2002,NaN,57,Sci-Fi

In [23]:
akas

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0
...,...,...,...,...,...,...,...,...
37509737,tt9916560,1,March of Dimes Presents: Once Upon a Dime,US,NaN,imdbDisplay,NaN,0
37509807,tt9916620,1,The Copeland Case,US,NaN,imdbDisplay,NaN,0
37509896,tt9916702,1,Loving London: The Playground,US,NaN,NaN,NaN,0
37509939,tt9916756,1,Pretty Pretty Black Girl,US,NaN,imdbDisplay,NaN,0
37509955,tt9916764,1,38,US,NaN,imdbDisplay,NaN,0

In [24]:
# Filter the basics table down to only include the US by using the filter ratings dataframe
#is_us = (akas['region'] == 'US')
#akas = akas[is_us]
keepers1 = (ratings['tconst'].isin(akas['titleId']))
keepers1

0           True
1           True
2          False
3          False
4           True
           ...
1359499    False
1359500    False
1359501    False
1359502    False
1359503    False
Name: tconst, Length: 1359504, dtype: bool

In [25]:
# Filter the basics table down to only include the US by using the filter ratings dataframe
ratings = ratings[keepers1]
ratings

            tconst  averageRating  numVotes
0        tt0000001            5.7      2002
1        tt0000002            5.8       269
4        tt0000005            6.2      2678
5        tt0000006            5.0       182
6        tt0000007            5.4       838
...            ...            ...       ...
1359466  tt9916200            8.1       238
1359467  tt9916204            8.2       273
1359474  tt9916348            8.3        18
1359475  tt9916362            6.4      5570
1359480  tt9916428            3.5        17

[511875 rows x 3 columns]

In [26]:
#remove orphaned records from akas
# Get indexes where name column doesn't have value tconst
#akas['titleId'].sum()
#indexNames = akas[~(akas['titleId'].isin(basics['tconst']))].index 
# Delete these row indexes from dataFrame
#akas.drop(indexNames , inplace=True)
#akas['titleId'].sum()

In [27]:
#remove orphaned records from ratings
# Get indexes where name column doesn't have value tconst
#ratings['tconst'].sum()
#indexNames = ratings[~(ratings['tconst'].isin(basics['tconst']))].index 
# Delete these row indexes from dataFrame
#ratings.drop(indexNames , inplace=True)
#ratings['tconst'].sum()

In [28]:
## Check each df
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5493 entries, 34800 to 10224024
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          5493 non-null   object
 1   titleType       5493 non-null   object
 2   primaryTitle    5493 non-null   object
 3   originalTitle   5493 non-null   object
 4   isAdult         5493 non-null   object
 5   startYear       5493 non-null   object
 6   endYear         0 non-null      object
 7   runtimeMinutes  5493 non-null   object
 8   genres          5493 non-null   object
dtypes: object(9)
memory usage: 429.1+ KB

In [29]:
## Check each df
ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 511875 entries, 0 to 1359480
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         511875 non-null  object
 1   averageRating  511875 non-null  float64
 2   numVotes       511875 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 15.6+ MB

In [30]:
## Check each df
akas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1471955 entries, 5 to 37509955
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1471955 non-null  object
 1   ordering         1471955 non-null  int64
 2   title            1471955 non-null  object
 3   region           1471955 non-null  object
 4   language         4168 non-null     object
 5   types            984637 non-null   object
 6   attributes       47615 non-null    object
 7   isOriginalTitle  1470614 non-null  object
dtypes: int64(1), object(7)
memory usage: 101.1+ MB

#**4. Write the data**

In [32]:
## Save current dataframe to file with underscore
basics.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)
ratings.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)
akas.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)

In [33]:
# Open saved file and preview again
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama
2,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000,NaN,86,"Musical,Romance"
3,tt0113092,movie,For the Cause,For the Cause,0,2000,NaN,100,"Action,Adventure,Drama"
4,tt0114447,movie,The Silent Force,The Silent Force,0,2001,NaN,90,Action

In [34]:
# Open saved file and preview again
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000005            6.2      2678
3  tt0000006            5.0       182
4  tt0000007            5.4       838

In [35]:
# Open saved file and preview again
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0